Revit 2024 API
SpecTypeId.HvacEnergy Property
 Energy, in discipline Energy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId HvacEnergy { get; }
Visual Basic
Public Shared ReadOnly Property HvacEnergy As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ HvacEnergy {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace